#+TITLE: Function Scope / MATLAB
#+REVEAL_THEME: dracula
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_EXTRA_SCRIPTS: ("https://code.jquery.com/jquery-3.7.1.min.js" "https://www.xn--4-cmb.com/rpoll/poll.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/audio-slideshow/plugin.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/audio-slideshow/recorder.js" "https://cdnjs.cloudflare.com/ajax/libs/RecordRTC/5.6.2/RecordRTC.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/anything/plugin.js" "https://cdn.jsdelivr.net/npm/reveal.js-plugins@latest/customcontrols/plugin.js")
#+REVEAL_EXTRA_CSS: https://www.xn--4-cmb.com/rpoll/poll.css
#+REVEAL_HIGHLIGHT_CSS_IGNORE: reveal.js/plugin/highlight/monokai.css
#+PROPERTY: HEADER-ARGS+ :eval no-export
#+OPTIONS:  toc:nil
*** ls()

#+begin_src R :results output :exports both :van
x <- 1
myprint <- function(x, inc_val=1) {
  print(x + inc_val)
}

ls()
#+end_src

#+RESULTS:
: [1] "myprint" "x"


*** Comments
 * end with ~;~ to suppress output
 * ~;~ within an array stats a new row
 * ~%~ to comment
 * ~...~ to continue on the next line (a la ~\~ in shell)
#+begin_src octave :exports both :results output
x = [1 ... any text after '...' is ignored
     2]     % same as x = [1 2];
y = [1; 2], % vertical vector (column vector)
z = [1, 2]; % semi column ending, output not shown
#+end_src


#+RESULTS:
: x =
:
:    1   2
:
: y =
:
:    1
:    2
:

*** single quote

#+begin_src octave :exports both :results output
x = [1; 2]' % transpose vert to horz
c = 'this is a string'
#+end_src

#+RESULTS:
: x =
:
:    1   2
:
: c = this is a string

*** Implied quotes
without ~()~, matlab assumes first word is command and second is in quotes
#+begin_src octave :exports both :results output
cd /tmp    % same as cd("/tmp")
pwd

% example with quotes
cd("~")
pwd
#+end_src

#+RESULTS:
: ans = /tmp
: ans = /home/foranw

*** Parens

 * functions are called with ~()~ (same as R and python)
 * arrays index access with ~()~ 🤪 (R, python, shell use ~[]~)
   * ~{}~ and ~()~ used for cells (foreshadowing)
#+COMMENT: * reference functions with ~@~ prefix (advanced topic)

#+begin_src octave :exports both :results output
x = [1 2]; % this is an array
x(2),      % index 1 is first
mean(x),   % functions called like arrays
#+end_src

#+RESULTS:
: ans = 2
: ans = 1.5000

# TODO: as what x(2) will be

{{{mpoll(why no 'x' in output?, <li>assigned to variable</li> <li>ends with ;</li>, data-fragment-index=1)}}}

*** ranges
Matlab requires explicit ~:~ for "all columns"
#+REVEAL_HTML:<div style="float:left; width:50%">
*R*
#+begin_src R :exports both :results output
print( x <- matrix(1:4,nrow=2) )
print(x[,2]) # same as 'x[1:2, 2]'
#+end_src

#+RESULTS:
:      [,1] [,2]
: [1,]    1    3
: [2,]    2    4
: [1] 3 4


#+REVEAL_HTML: </div><div class="right" style="float:right; width:50%">
*Matlab*
#+begin_src octave :exports both :results output
x = reshape(1:4, [2,2])
col = x(:, 2) % same as 'x(1:2, 2)'
#+end_src
#+RESULTS:
#+begin_example
x =

   1   3
   2   4

col =

   3
   4

#+end_example
#+REVEAL_HTML: </div>

*** logical
 * *~=* is ~!=~ in most other languages
 * ~0~ is false, ~1~ is true

#+begin_src octave :exports both :results output
x         = [3 4 5 6];
not_gt4   =  ~ (x > 4)
not_4     =  x ~= 4
not_empty = ~isempty(x)
#+end_src

#+RESULTS:
: not_gt4 =
:
:   1  1  0  0
:
: not_4 =
:
:   1  0  1  1
:
: not_empty = 1

*** logical range

#+begin_src octave :exports both :results output
x = 3:6;
x(x > 4)
x(x > 4) = 4 % set max to 4
#+end_src

#+RESULTS:
: ans =
:
:    5   6
:
: x =
:
:    3   4   4   4
:

** Cells
cells are like lists in R. They can store any number of any type.
#+begin_src octave :exports both :results output
y = {3, 'fizz', 4:5},
#+end_src

#+RESULTS:
#+begin_example
y =
{
  [1,1] = 3
  [1,2] = fizz
  [1,3] =

     4   5

}

#+end_example

*** length of each element in the cell
   :PROPERTIES:
   :reveal_background: pink
   :END:
   preview of cellfun
#+begin_src octave :exports both :results output
y = {1:4, 'lorem ipsum', 100:200};
cellfun(@length, y)
#+end_src

#+RESULTS:
: ans =
:
:      4    11   101
:

*** concat cells
   :PROPERTIES:
   :reveal_background: #555
   :END:
 * ~{:}~ gets all values. can combine
#+begin_src octave :exports both :results output
y = { 1:2, 4:5, 10:12};
as_vec = [ y{:} ] % aka 'horzcat()', can be diff dims
vec_mean = mean(as_vec)
#+end_src

#+RESULTS:
: asvec =
:
:     1    2    4    5   10   11   12
:
: ans = 6.4286

*** concat cells
   :PROPERTIES:
   :reveal_background: #555
   :END:
#+begin_src octave :exports both :results output
z = { 1:3, 4:6, 10:12};
as_mat = vertcat( z{:} ) % cell dims must match
col_mean = mean(as_mat, 2)
#+end_src

#+RESULTS:
#+begin_example
as_mat =

    1    2    3
    4    5    6
   10   11   12

col_mean =

    2
    5
   11

#+end_example

** Structs

 * ~.~ accesses structure field
#+begin_src octave :exports both :results output
% declaritive
my_stct.f1 = 'a';
my_stct.f2 = 100;
my_stct

% inline
my_stct2 = struct('f1','a', 'f2',101)
#+end_src

#+RESULTS:
#+begin_example
my_stct =

  scalar structure containing the fields:

    f1 = a
    f2 = 100

my_stct2 =

  scalar structure containing the fields:

    f1 = a
    f2 = 101

#+end_example

*** Array of structs

#+begin_src octave :exports both :results output
my_stct(1) = struct('f1','a', 'f2',101);
my_stct(2) = struct('f1','b', 'f2',12);
my_stct

f2 = [my_stct.f2]
#+end_src

#+RESULTS:
#+begin_example
my_stct =

  1x2 struct array containing the fields:

    f1
    f2

f2 =

   101    12

#+end_example

*** Array of structs

#+begin_src octave :exports both :results output
my_stct = [struct('f1','a', 'f2',101)
           struct('f1','b', 'f2',12)];

f1 = {my_stct.f1}
f1_c = [my_stct.f1]
#+end_src

#+RESULTS:
: f1 =
: {
:   [1,1] = a
:   [1,2] = b
: }
:
: f1_c = ab


*** fieldnames

#+begin_src octave :exports both :results output
my_stct = struct('f1','a', 'f2',101);
fieldnames(my_stct)
#+end_src

#+RESULTS:
: ans =
: {
:   [1,1] = f1
:   [2,1] = f2
: }
:

*** looping over fieldnames
 * transpose field names for loop
 * cell element nesting :( ~f{1}~ to undo
#+begin_src octave :exports both :results output
my_stct = struct('f1','a', 'f2',101);
for f = fieldnames(my_stct)'
  fprintf("%s: %d\n", f{1}, my_stct.(f{1}))
end
#+end_src

#+RESULTS:
: f1: 97
: f2: 101

*** structs in the wild
   :PROPERTIES:
   :reveal_background: pink
   :END:

#+begin_src octave :exports both :results output
flist = dir('private/')
#+end_src

#+RESULTS:
#+begin_example
x =

  12x1 struct array containing the fields:

    name
    folder
    date
    bytes
    isdir
    datenum
    statinfo

#+end_example

** iterate
#+REVEAL_HTML: <div class="column" style="float:left; width:50%">
*R*
#+begin_src R :exports both :results output
# for loop example
for(i in 1:3){
  print(i)
}
#+end_src

#+RESULTS:
: [1] 1
: [1] 2
: [1] 3


#+REVEAL_HTML: </div><div class="right" style="float:right; width:50%">
*Matlab*
#+begin_src octave :exports both :results output
% for loop example
for(i=1:3)
  disp(i);
end
#+end_src
#+RESULTS:
: 1
: 2
: 3
#+REVEAL_HTML: </div>

** iterate

Using an index to access data is more common in matlab (FORTRAN heritage). Paradigm is
 - generate a bunch of data in bulk
 - access it as needed by it's index (vs. by name in a dataframe)

#+begin_src octave :exports both :results output
x = rand(1, 3),
for(i = 1:length(x))
  disp( x(i) );
end
#+end_src

#+RESULTS:
: x =
:
:    0.534157   0.045420   0.548919
:
: 0.5342
: 0.045420
: 0.5489

** vectorize
for loops are convenient but vectors are fassssst 🐇.
#+REVEAL_HTML: <div style="float:left; width:50%">
*bad*
#+begin_src octave :exports both :results output
x = [1 1 2 3 5 8];
for(i = 1:length(x))
  x3x(i) = 3 * x(i);
end
disp(x3x)
#+end_src

#+RESULTS:
:     3    3    6    9   15   24

#+REVEAL_HTML: </div><div style="float:right; width:50%">
*good*
#+begin_src octave :exports both :results output
x = [1 1 2 3 5 8];
x3x = 3 * x;
disp(x3x);
#+end_src

#+RESULTS:
:     3    3    6    9   15   24

#+REVEAL_HTML: </div>

*** whos
#+begin_src octave :exports both :results output
x = 1;
whos
disp('-----')
clear all
whos
#+end_src

#+RESULTS:
#+begin_example
Variables visible from the current scope:

variables in scope: top scope

  Attr   Name        Size                     Bytes  Class
  ====   ====        ====                     =====  =====
         x           1x1                          8  double

Total is 1 element using 8 bytes

-----
#+end_example

*** Example Func

save a file
#+begin_src octave :exports code :tangle private/my_ex.m :eval never
% saved to private/my_ex.m
function [out] = my_ex(in)
  r = 0.9560;
  out = in + r;
end
#+end_src

use in command window or script
#+begin_src octave :exports both :results output
my_ex(1)
#+end_src

#+RESULTS:
: ans = 1.9560


*** anonymous functions
   :PROPERTIES:
   :reveal_background: #555
   :END:
 * for inline anonymous ("lambda") functions
 * doesn't need a new file
 * cannot have multiple steps/lines of code
#+begin_src octave :exports both :results output
my_xXx = @(foobar) foobar*3;  % same as '@(x) x*3'

my_xXx(4)
#+end_src

#+RESULTS:
: ans = 12

https://www.youtube.com/watch?v=GsTOpgABeGY&t=18s

*** variable outputs
 * functions output more info when asked
 * ask by specifying more than one output
#+begin_src octave :exports both :results output
x_s = sort([3 1 2]),
#+end_src

#+RESULTS:
: x_s =
:
:    1   2   3
:

#+begin_src octave :exports both :results output
[x_s, x_i] = sort([3 1 2]),
#+end_src

#+RESULTS:
: x_s =
:
:    1   2   3
:
: x_i =
:
:    2   3   1
:

*** using func vars

#+begin_src octave :exports code :tangle private/argcount.m :eval never
% saved to private/argcount.m
function [varargout] = argcount(varargin)
 disp(nargin);
 disp(nargout);
 varargout = varargin; % output is input
end
#+end_src

#+begin_src octave :exports both :results output
x = argcount(1,2,3);
#+end_src

#+RESULTS:
: 3
: 1

#+begin_src octave :exports both :results output
[x, y, z] = argcount(1,2,3);
#+end_src

#+RESULTS:
: 3
: 3

*** dynamic output

#+begin_src octave :exports code :tangle private/evil.m :eval never
% saved to private/evil.m
function [varargout] = evil(varargin)
 if nargout > 1
    varargout{1} = varargin{2};
    varargout{2} = 0;
 else
    varargout{1} = varargin{1};
 end
end
#+end_src

#+begin_src octave :exports both :results output
x = evil(1,2,3),
#+end_src

#+RESULTS:
: x = 1

#+begin_src octave :exports both :results output
[x, y] = evil(1,2,3),
#+end_src

#+RESULTS:
: x = 2
: y = 0

*** Global vs Local
matlab stricter than R about global variables (yay!)
#+begin_src octave :exports code :tangle private/add2.m
% saved to private/add2.m
function [added] = add2(x)
  global addbase
  added = x + 2 + addbase;
end
#+end_src

#+begin_src octave :exports both :results output
global addbase = 3;
add2(4)
#+end_src

#+RESULTS:
: ans = 9

*** persistent keyword

#+begin_src octave :exports code :tangle private/add3.m
% saved to private/add3.m
function [added] = add3(x)
  persistent addbase
  if isempty(addbase), addbase = 0; end % init on first call
  addbase = addbase + 1; % increment every function call!
  added = x + 3 + addbase;
end
#+end_src

#+begin_src octave :exports both :results output
add3(1)
add3(1)
#+end_src

#+RESULTS:
: ans = 5
: ans = 6


*** example
#+begin_src octave :results output :exports both
x = [1 -2 -3 4];
arrayfun(@sign, x) % same as 'sign(x)'
#+end_src

#+RESULTS:
: ans =
:
:    1  -1  -1   1
:

*** example UninformOutput=0
#+begin_src octave :results output :exports both
x = [1 2 2];
arrayfun(@rand, x, 'UniformOutput', 0)
#+end_src

#+RESULTS:
#+begin_example
ans =
{
  [1,1] = 0.2129
  [1,2] =

     8.7922e-03   6.1499e-01
     8.2587e-01   1.3682e-01

  [1,3] =

     0.435227   0.102539
     0.063482   0.077147

}

#+end_example

*** structs in the wild
   :PROPERTIES:
   :reveal_background: #110
   :END:
#+begin_src octave :exports both :results output
flist = dir('private/');
fpath = arrayfun(@(f) fullfile(f.folder, f.name),...
                 flist, 'UniformOutput', 0);
fpath(3:end-4)
#+end_src

#+RESULTS:
#+begin_example
ans =
{
  [1,1] = /home/foranw/src/work/present/private/add2.m
  [2,1] = /home/foranw/src/work/present/private/add3.m
  [3,1] = /home/foranw/src/work/present/private/argcount.m
  [4,1] = /home/foranw/src/work/present/private/evil.m
  [5,1] = /home/foranw/src/work/present/private/my_ex.m
  [6,1] = /home/foranw/src/work/present/private/mycat.m
}

#+end_example

